music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Smash Mouth"], ["created_at", "2018-11-16 00:43:52.298710"], ["updated_at", "2018-11-16 00:43:52.298710"]]
---
  def create
    band = Band.new(name: params[:band][:name])

    if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Knuckleback"], ["updated_at", "2018-11-16 01:25:42.163056"], ["id", 3]]
---
  def update
    band = Band.find(params[:id])

    if band.update_attributes(name: params[:band][:name])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]
---
  def destroy
    band = Band.find(params[:id])
    band.destroy